*      filename: Sample.cbl
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SampleProgram.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 Counter PIC 9(3) VALUE 0.
000600 PROCEDURE DIVISION.
000700 PERFORM 10-TIMES.
000800 STOP RUN.
000900 10-TIMES.
001000 ADD 1 TO Counter.
001100 DISPLAY 'Counter: ' Counter.
