* filename: Sample.cbl
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HelloWorld.
000300
000400 PROCEDURE DIVISION.
000500     DISPLAY 'Hello, World!'.
000600     STOP RUN.
